src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Автор</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеТоваров/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль менеджера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует табличный документ из макета ПеремещениеТоваров и заполняет данными документа.
//
// Параметры:
//  Документ - ДокументСсылка.ПеремещениеТоваров - ссылка печатаемого документа. 
// 
// Возвращаемое значение:
//   - ТабличныйДокумент
//
&НаСервере
Функция ПечатьПеремещениеТоваров(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.Номер КАК Номер,
		|	Документ.Дата КАК Дата,
		|	Документ.СкладОтправитель КАК СкладОтправитель,
		|	Документ.СкладПолучатель КАК СкладПолучатель,
		|	&Автор КАК Автор,
		|	Документ.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Товар КАК Товар,
		|		Количество КАК Количество
		|	) КАК Товары
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Документ);

	Макет 				= ПолучитьМакет("ПеремещениеТоваров");
	ПеремещениеТоваров 	= ПечатьСервер.ТабличныйДокументИзУниверсальногоЗапроса(Запрос, Макет);
	
	Возврат ПеремещениеТоваров;
	
КонецФункции

#КонецОбласти
